/*****************************************************************************
*                                                                            *
*  @file     CV_Draw.h                                                       *
*  @brief    此类为机器视觉-->画图类                                         *
*                                                                            *
*  @author   ZJH                                                             *
*  @email    877049745@qq.com                                                *
*  @version  1.0.0.1(版本号)                                                 *
*                                                                            *
*----------------------------------------------------------------------------*
*  Remark         : 无                                                       *
*----------------------------------------------------------------------------*
*  Change History :                                                          *
*  <Date>     | <Version> | <Author>       | <Description>                   *
*----------------------------------------------------------------------------*
*  2019/11/29 | 1.0.0.1   | ZJH            | Create file                     *
*----------------------------------------------------------------------------*
*                                                                            *
*****************************************************************************/
#include "MachineVision.h"
using namespace cv;
using namespace std;
class CV_Draw : public MachineVision
{
	/**
	 ************************************************************************
	 *@brief       在指定的图片上画圆
	 *@parameter
	 *
	 *             src      原图
	 *             x        X点
	 *             y        Y点
	 *             size     圆的大小
	 *
	 *@version     v1.0.0
	 *@author      ZJH
	 *@date        2019/09/20
	 *----------------------------------------------------------------------
	 *@修改时间:
	 *@修改人+联系方式:
	 *@说明(你为什么修改):
	 ************************************************************************
	 */
	void drawCircle(Mat src, int x, int y, int size);


	/**
	 ************************************************************************
	 *@brief       绘制矩形
	 *@parameter
	 *
	 *             drawRect   绘制的矩形
	 *             Canvas     画板
	 *
	 *@version     v1.0.0
	 *@author      ZJH
	 *@date        2019/09/24
	 *----------------------------------------------------------------------
	 *@修改时间:
	 *@修改人+联系方式:
	 *@说明(你为什么修改):
	 ************************************************************************
	 */
	void drawRect(Mat Canvas, cv::Rect drawRect);



	/**
	 ************************************************************************
	 *@brief       绘制轮廓
	 *@parameter
	 *
	 *             Contours   绘制的轮廓
	 *             Canvas     画板
	 *
	 *@version     v1.0.0
	 *@author      ZJH
	 *@date        2019/09/10
	 *----------------------------------------------------------------------
	 *@修改时间:             2019/09/17   9:53
	 *@修改人+联系方式:      张嘉皓 13821857896
	 *@说明(你为什么修改):    本次将参数的类型改为vector<cv::Point>类型
	 *                       上一版本的参数类型与当前版本的参数类型不大兼容
	 *                       需额外处理初始化好的数据 很不方便 故作此更改
	 ************************************************************************
	 */
	void drawContours(Mat Canvas, vector<cv::Point> Contours);



	/**
	 ************************************************************************
	 *@brief       绘制所有轮廓
	 *@parameter
	 *
	 *             Contours   绘制的轮廓
	 *             Canvas     画板
	 *
	 *@version     v1.0.0
	 *@author      ZJH
	 *@date        2019/09/24
	 *----------------------------------------------------------------------
	 *@修改时间:
	 *@修改人+联系方式:
	 *@说明(你为什么修改):
	 ************************************************************************
	 */
	void drawAllContours(Mat Canvas, vector<vector<cv::Point>> Contour);


	/**
	 ************************************************************************
	 *@brief       绘制最小矩形
	 *@parameter
	 *
	 *             Canvas  画板
	 *             rect    要绘制的最小矩阵
	 *
	 *@version     v1.0.0
	 *@author      ZJH
	 *@date        2019/10/23
	 *----------------------------------------------------------------------
	 *@修改时间:
	 *@修改人+联系方式:
	 *@说明(你为什么修改):
	 ************************************************************************
	 */
	void drawMinRect(Mat Canvas, RotatedRect rect);
	
};